ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/UC3_I2CC_1.0.xml
    <register id="UC3_I2CC_PECCTL" width="32" offset="0x1158" description="I2C PEC control register">
        <bitfield id="PECCNT" description="PEC Count
When this field is non zero, the number of I2C bytes are counted (Note that although the PEC is calculated on the I2C address it is not counted at a byte). When the byte count = PECCNT and the state machine is transmitting, the contents of the LSFR is loaded into the shift register instead of the byte received from the Tx FIFO. When the state machine is receiving, after the last bit of this byte is received the LSFR is checked and if it is non-zero, a PEC RX Error interrupt is generated. The I2C packet must be padded to include the PEC byte for both transmit and receive. In transmit mode the FIFO must be loaded with a dummy PEC byte. In receive mode the PEC byte will be passed to the Rx FIFO.
In the normal Controller use case, FW would set PECEN=1 and PECCNT=SMB packet length (Not including Target Address byte, but including the PEC byte). FW would then configure DMA to allow the packet to complete unassisted and write MCTR to initiate the transaction.
Note that when the byte count = PEC CNT, the byte count is reset to 0 and multiple PEC calculation can automatically occur within a single I2C transaction.
Note that any write to the I2PECCTL Register will clear the current PEC Byte Count in the State Machine." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
            <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
        </bitfield>
        <bitfield id="PECEN" description="PEC Enable
This bit enables the SMB Packet Error Checking (PEC). When enabled the PEC is calculated on all bits except the Start, Stop, Ack and Nack. The PEC LSFR and the Byte Counter is set to 0 when the State Machine is in the IDLE state, which occur following a Stop or when a timeout occurs. The Counter is also set to 0 after the PEC byte is sent or received. Note that the NACK is automatically send following a PEC byte that results in a PEC error.
The PEC Polynomial is x^8 + x^2 + x^1 + 1." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="PEC is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="PEC is enabled"/>
        </bitfield>
    </register>

</module>